'''
1개 1
2개 11 2
4개 111 12 21 3
7개 1111 / 112 121 112 / 22 / 13 31
13개 (1)1111 / (1)112 1121 1211 (2111) / (1)22 212 221 / 1(13) 1(31) 311 / (23) (32) 
    1+4+3+3+2=13
24개 111111 / 11112 / 1122 / 222 / 1113 / 123 / 33
    1+5+6+1+4+6=1=24
44개 1111111 / 111112 / 11122 / 1222 / 11113 / 1123 / 223 / 133
    1+7+10+4+5+12+3+3=44
'''
# 1,2,3만 사용하니까 N이 되려면 N-1+1, N-2+2, N-3+3 3가지 경우가 있다
# f(n) = f(n-1) + f(n-2) + f(n-3)

import sys
input = sys.stdin.readline

T = int(input())
for _ in range(T):    
    N = int(input())
    f = [0 for _ in range(N+1)]
    for i in range(1, N+1):
        if i==1: f[i]=1
        elif i==2: f[i]=2
        elif i==3: f[i]=4
        else:
            f[i] = f[i-1]+f[i-2]+f[i-3]
        
    print(f[N])
